performance-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 10
    - duration: 60
      arrivalRate: 15
  defaults:
    headers:
      'Content-Type': 'application/json'

scenarios:
  - name: "API Welcome Load Test"
    weight: 40
    flow:
      - get:
          url: "/"
          capture:
            - json: "$.message"
              as: "welcome_message"
      - think: 1

  - name: "Frontend Load Test"
    weight: 60
    flow:
      - get:
          url: "http://localhost:3001/"
      - think: 2
      - get:
          url: "http://localhost:3001/login"
      - think: 1
      - get:
          url: "http://localhost:3001/signup"
      - think: 2